In [1]:
import pandas as pd
import pandas.io.formats.style 
import numpy as np
import sqlalchemy as sql
from config import db_uri

In [2]:
engine = sql.create_engine(db_uri)
engine

Engine(mysql://root:***@localhost/python_exercise_2)

In [3]:
df_owners = pd.read_sql_table('owner', engine)
df_puppies = pd.read_sql_table('puppies', engine)

In [4]:
df_owners

    owner_id owner_name            address           city state zipcode
0          1       marc         120 elm st          miami    fl   30050
1          3      maria     746 clinton ct   philadelphia    pa   11203
2          4     joanne      12003 main st     littletown    ks   20303
3          5      miles      12034 main rd      smalltown    ms   24455
4          6       luke      74847 left ln        seattle    wa   98748
5          7      moses       836 ocean dr  san francisco    ca   98288
6          8     hannah       89 pines ave    albuquerque    nm   11253
7          9      sarah      345 valley st        phoenix    az   87989
8         10       joel        76 river rd     des moines    ia   56433
9         11  phillippe         43 lane st    los angeles    ca   90210
10        12     louise   10 market street         denver    co   80209
11        13    jessica  50 sam houston ln        houston    tx   77001

In [5]:
df_puppies

,puppy_id,owner_id,puppy_name,age,gender,height_inches,color,favorite_food
0,1,1,wake,9.0,female,13.0,gray,dry food
1,2,1,yangoon,6.0,male,40.0,gray,dry food
2,5,3,oregon,0.0,female,13.0,brown,lamb treats
3,6,3,eugene,10.0,male,12.0,gray,lamb treats
4,7,4,nogales,12.0,female,18.0,gray,beef jerkey
5,8,4,wilkes,1.0,female,39.0,black,chicken bites
6,9,5,raleigh,7.0,female,12.0,golden,dry food
7,10,5,eagle,3.0,male,27.0,gray,beef jerkey
8,11,6,oakley,2.0,male,47.0,golden,lamb treats
9,12,6,nampa,7.0,female,45.0,beige,beef jerkey
10,13,7,young,5.0,male,32.0,white,lamb treats
11,14,7,kalamazoo,7.0,female,38.0,gray,chicken bites
12,15,8,edison,5.0,male,21.0,gray,lamb treats
13,16,8,wayne,11.0,female,17.0,golden,lamb treats
14,17,9,newton,11.0,male,36.0,beige,beef jerkey
15,18,9,yuma,1.0,male,43.0,beige,beef jerkey
16,19,10,orange,2.0,female,32.0,beige,dry food
17,20,10,reedley,6.0,female,30.0,beige,beef jerkey
18,21,12,berlin,2.0,female,10.5,brown,chicken treats
19,22,11,paris,4.0,female,12.0,white,jerky
20,23,13,london,5.0,male,20.0,black,lamb
21,24,8,vienna,1.0,female,9.5,beige,jerky

In [6]:
df_owners = df_owners.rename(columns= { "owner_id": "Owner ID", "owner_name": "Owner Name", "address": "Address", "city": "City", "state": "State", "zipcode": "Zip Code" })

In [7]:
df_puppies = df_puppies.rename(columns= { "puppy_id": "Puppy ID", "owner_id": "Owner ID", "puppy_name": "Puppy Name", "age": "Age", "gender": "Gender", "height_inches": "Height (in)", "color": "Color", "favorite_food": "Favorite Food" })

In [8]:
df_owners

    Owner ID Owner Name            Address           City State Zip Code
0          1       marc         120 elm st          miami    fl    30050
1          3      maria     746 clinton ct   philadelphia    pa    11203
2          4     joanne      12003 main st     littletown    ks    20303
3          5      miles      12034 main rd      smalltown    ms    24455
4          6       luke      74847 left ln        seattle    wa    98748
5          7      moses       836 ocean dr  san francisco    ca    98288
6          8     hannah       89 pines ave    albuquerque    nm    11253
7          9      sarah      345 valley st        phoenix    az    87989
8         10       joel        76 river rd     des moines    ia    56433
9         11  phillippe         43 lane st    los angeles    ca    90210
10        12     louise   10 market street         denver    co    80209
11        13    jessica  50 sam houston ln        houston    tx    77001

In [9]:
df_puppies

,Puppy ID,Owner ID,Puppy Name,Age,Gender,Height (in),Color,Favorite Food
0,1,1,wake,9.0,female,13.0,gray,dry food
1,2,1,yangoon,6.0,male,40.0,gray,dry food
2,5,3,oregon,0.0,female,13.0,brown,lamb treats
3,6,3,eugene,10.0,male,12.0,gray,lamb treats
4,7,4,nogales,12.0,female,18.0,gray,beef jerkey
5,8,4,wilkes,1.0,female,39.0,black,chicken bites
6,9,5,raleigh,7.0,female,12.0,golden,dry food
7,10,5,eagle,3.0,male,27.0,gray,beef jerkey
8,11,6,oakley,2.0,male,47.0,golden,lamb treats
9,12,6,nampa,7.0,female,45.0,beige,beef jerkey
10,13,7,young,5.0,male,32.0,white,lamb treats
11,14,7,kalamazoo,7.0,female,38.0,gray,chicken bites
12,15,8,edison,5.0,male,21.0,gray,lamb treats
13,16,8,wayne,11.0,female,17.0,golden,lamb treats
14,17,9,newton,11.0,male,36.0,beige,beef jerkey
15,18,9,yuma,1.0,male,43.0,beige,beef jerkey
16,19,10,orange,2.0,female,32.0,beige,dry food
17,20,10,reedley,6.0,female,30.0,beige,beef jerkey
18,21,12,berlin,2.0,female,10.5,brown,chicken treats
19,22,11,paris,4.0,female,12.0,white,jerky
20,23,13,london,5.0,male,20.0,black,lamb
21,24,8,vienna,1.0,female,9.5,beige,jerky

In [10]:
df_owners['Owner Name'] = df_owners['Owner Name'].str.capitalize()
df_owners['Address'] = df_owners['Address'].str.title()
df_owners['City'] = df_owners['City'].str.title()
df_owners['State'] = df_owners['State'].str.upper()

In [11]:
df_puppies['Puppy Name'] = df_puppies['Puppy Name'].str.capitalize()
df_puppies['Favorite Food'] = df_puppies['Favorite Food'].str.title()

In [12]:
df_owners

    Owner ID Owner Name            Address           City State Zip Code
0          1       Marc         120 Elm St          Miami    FL    30050
1          3      Maria     746 Clinton Ct   Philadelphia    PA    11203
2          4     Joanne      12003 Main St     Littletown    KS    20303
3          5      Miles      12034 Main Rd      Smalltown    MS    24455
4          6       Luke      74847 Left Ln        Seattle    WA    98748
5          7      Moses       836 Ocean Dr  San Francisco    CA    98288
6          8     Hannah       89 Pines Ave    Albuquerque    NM    11253
7          9      Sarah      345 Valley St        Phoenix    AZ    87989
8         10       Joel        76 River Rd     Des Moines    IA    56433
9         11  Phillippe         43 Lane St    Los Angeles    CA    90210
10        12     Louise   10 Market Street         Denver    CO    80209
11        13    Jessica  50 Sam Houston Ln        Houston    TX    77001

In [13]:
df_puppies

,Puppy ID,Owner ID,Puppy Name,Age,Gender,Height (in),Color,Favorite Food
0,1,1,Wake,9.0,female,13.0,gray,Dry Food
1,2,1,Yangoon,6.0,male,40.0,gray,Dry Food
2,5,3,Oregon,0.0,female,13.0,brown,Lamb Treats
3,6,3,Eugene,10.0,male,12.0,gray,Lamb Treats
4,7,4,Nogales,12.0,female,18.0,gray,Beef Jerkey
5,8,4,Wilkes,1.0,female,39.0,black,Chicken Bites
6,9,5,Raleigh,7.0,female,12.0,golden,Dry Food
7,10,5,Eagle,3.0,male,27.0,gray,Beef Jerkey
8,11,6,Oakley,2.0,male,47.0,golden,Lamb Treats
9,12,6,Nampa,7.0,female,45.0,beige,Beef Jerkey
10,13,7,Young,5.0,male,32.0,white,Lamb Treats
11,14,7,Kalamazoo,7.0,female,38.0,gray,Chicken Bites
12,15,8,Edison,5.0,male,21.0,gray,Lamb Treats
13,16,8,Wayne,11.0,female,17.0,golden,Lamb Treats
14,17,9,Newton,11.0,male,36.0,beige,Beef Jerkey
15,18,9,Yuma,1.0,male,43.0,beige,Beef Jerkey
16,19,10,Orange,2.0,female,32.0,beige,Dry Food
17,20,10,Reedley,6.0,female,30.0,beige,Beef Jerkey
18,21,12,Berlin,2.0,female,10.5,brown,Chicken Treats
19,22,11,Paris,4.0,female,12.0,white,Jerky
20,23,13,London,5.0,male,20.0,black,Lamb
21,24,8,Vienna,1.0,female,9.5,beige,Jerky

In [14]:
amount_owners = len(df_owners)
amount_puppies = len(df_puppies)

In [15]:
amount_owners

12

In [16]:
amount_puppies

22

In [17]:
amount_cols_owners = df_owners.count(axis = 1)[0]
amount_cols_pupppies = df_puppies.count(axis = 1)[0]

In [18]:
amount_cols_owners

6

In [19]:
amount_cols_pupppies

8

In [20]:
df_owner_id_in_puppies = pd.DataFrame(df_puppies['Owner ID'])
df_owner_names = pd.DataFrame(df_owners[['Owner ID', 'Owner Name']])
df_joined_table = df_owner_names.merge(df_owner_id_in_puppies, how = 'left')

In [21]:
puppies_per_owner = ((df_joined_table.groupby(['Owner Name']).size()).reset_index(name = 'Total Puppies')).sort_values(by = ['Total Puppies'], ascending = False)

In [22]:
puppies_per_owner = puppies_per_owner.reset_index().drop(['index'], axis = 1)

In [23]:
puppies_per_owner

   Owner Name  Total Puppies
0      Hannah              3
1      Joanne              2
2        Joel              2
3        Luke              2
4        Marc              2
5       Maria              2
6       Miles              2
7       Moses              2
8       Sarah              2
9     Jessica              1
10     Louise              1
11  Phillippe              1

In [24]:
df_puppies = df_puppies.rename(columns = {'Favorite Food': 'Top Favorite Foods'})
favorite_food = ((df_puppies.groupby(['Top Favorite Foods']).size()).reset_index(name = 'Totals')).sort_values(by = ['Totals'], ascending = False)
favorite_food = favorite_food.reset_index().drop(['index'], axis = 1)

In [25]:
favorite_food

  Top Favorite Foods  Totals
0        Beef Jerkey       6
1        Lamb Treats       6
2           Dry Food       4
3      Chicken Bites       2
4              Jerky       2
5     Chicken Treats       1
6               Lamb       1

In [26]:
puppies_color = ((df_puppies.groupby(['Color']).size()).reset_index(name = 'Totals')).sort_values(by = ['Totals'], ascending = False)
puppies_color = puppies_color.reset_index().drop(['index'], axis = 1)

In [27]:
puppies_color

    Color  Totals
0    gray       7
1   beige       6
2  golden       3
3   black       2
4   brown       2
5   white       2

In [28]:
less_than_five = len(df_puppies[df_puppies['Age'].between(0, 4)])
between_five_and_ten = len(df_puppies[df_puppies['Age'].between(5, 10)])
more_than_ten = len(df_puppies[df_puppies['Age'] > 10])

In [29]:
puppies_age = {'Less than 5': [less_than_five], 'Between 5 and 10': [between_five_and_ten], 'More than 10': [more_than_ten]}
df_puppies_age = pd.DataFrame(puppies_age)

In [30]:
df_puppies_age

   Less than 5  Between 5 and 10  More than 10
0            9                10             3